// ==UserScript==
// @name         让我康康你的标题正不正常啊
// @namespace    https://naizi.moe
// @version      1.0.0
// @description  一个反Unicode标题污染脚本，替换各种奇妙的英文字符，暴力模式下会移除标题中99.99%的emoji。
// @author       Neutralized
// @license      GPL-3.0
// @match        https://www.bilibili.com/video/*
// @homepage     https://github.com/Neutralization/Antimemetics-Division
// @icon         https://www.bilibili.com/favicon.ico
// @grant        none
// ==/UserScript==

function c(g) {
    let typ = 0;
    if (g.length == 1) {
        typ = 0;
    } else if (g.length == 2 && g.charAt(0) === g.charAt(0).toLowerCase()) {
        typ = -1;
    } else if (g.length == 2 && g.charAt(0) === g.charAt(0).toUpperCase()&& g.charAt(1) === g.charAt(1).toLowerCase()) {
        typ = 0;
    } else if (g.length == 2 && g.charAt(0) === g.charAt(0).toUpperCase()&& g.charAt(1) === g.charAt(1).toUpperCase()) {
        typ = 1;
    } else if ([...g.matchAll(/[A-Z]/g)].length == 0) {
        typ = -1;
    } else if ([...g.matchAll(/[A-Z]/g)].length < [...g.matchAll(/[a-z]/g)].length) {
        typ = 0;
    } else if ([...g.matchAll(/[A-Z]/g)].length >= [...g.matchAll(/[a-z]/g)].length) {
        typ = 1;
    } else {
        typ = 0;
    }
    return typ;
}

function r(group) {
    const count = {'0': 0, '1': 0, '-1': 0};
    const reg = [];
    for (let i = 0; i < group.length; i++) {
        count[c(group[i])] += 1;
    }
    for (let i = 0; i < group.length; i++) {
        const g = group[i];
        if (count[-1] >= group.length / 2) {
            reg.push(g.toLowerCase());
        } else if (count[1] >= group.length / 2) {
            reg.push(g.toUpperCase());
        } else {
            reg.push(g.charAt(0).toUpperCase() + g.slice(1).toLowerCase());
        }
    }
    return reg;
}

function n() {
    /* eslint-disable */
    const fiftyfive = {'0': ['ʘ', 'Ѳ', '⁰', '₀', '⓪', '⓿', '０', '𝟎', '𝟘', '𝟢', '𝟬', '𝟶', '🄀', '🄁', '🄌', '🯰'], '1': ['¹', '₁', '⅟', '①', '⑴', '⒈', '⓵', '❶', '➀', '➊', '１', '𝟏', '𝟙', '𝟣', '𝟭', '𝟷', '🄂', '🯱'], '2': ['²', 'ƻ', '₂', '②', '⑵', '⒉', '⓶', '❷', '➁', '➋', '２', '𝟐', '𝟚', '𝟤', '𝟮', '𝟸', '🄃', '🯲'], '3': ['³', '₃', '③', '⑶', '⒊', '⓷', '❸', '➂', '➌', '３', '𝟑', '𝟛', '𝟥', '𝟯', '𝟹', '🄄', '🯳'], '4': ['౺', '⁴', '₄', '④', '⑷', '⒋', '⓸', '❹', '➃', '➍', '４', '𝟒', '𝟜', '𝟦', '𝟰', '𝟺', '🄅', '🯴'], '5': ['⁵', '₅', '⑤', '⑸', '⒌', '⓹', '❺', '➄', '➎', '５', '𝟓', '𝟝', '𝟧', '𝟱', '𝟻', '🄆', '🯵'], '6': ['⁶', '₆', '⑥', '⑹', '⒍', '⓺', '❻', '➅', '➏', '６', '𝟔', '𝟞', '𝟨', '𝟲', '𝟼', '🄇', '🯶'], '7': ['⁷', '₇', '⑦', '⑺', '⒎', '⓻', '❼', '➆', '➐', '７', '𝟕', '𝟟', '𝟩', '𝟳', '𝟽', '🄈', '🯷'], '8': ['⁸', '₈', '⑧', '⑻', '⒏', '⓼', '❽', '➇', '➑', '８', '𝟖', '𝟠', '𝟪', '𝟴', '𝟾', '🄉', '🯸'], '9': ['⁹', '₉', '⑨', '⑼', '⒐', '⓽', '❾', '➈', '➒', 'Ⳋ', '９', '𝟗', '𝟡', '𝟫', '𝟵', '𝟿', '𝯿', '🄊', '🯹'], 'a': ['ª', 'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ā', 'ă', 'ą', 'ǎ', 'ǟ', 'ǻ', 'ȁ', 'ȃ', 'ȧ', 'ɐ', 'ɑ', 'Δ', 'ά', 'α', 'а', '੨', 'ค', 'ᗩ', 'ᥲ', 'ᵃ', 'ᵄ', 'ᵅ', 'ᶺ', 'ḁ', 'ẚ', 'ạ', 'ả', 'ấ', 'ầ', 'ẫ', 'ậ', 'ắ', 'ằ', 'ẳ', 'ặ', 'ᾱ', 'ₐ', '⒜', 'ⓐ', 'ⲁ', 'ａ', '𝐚', '𝑎', '𝒂', '𝒶', '𝓪', '𝔞', '𝕒', '𝖆', '𝖺', '𝗮', '𝘢', '𝙖', '𝚊', '𝛂', '𝛼', '𝜕', '𝜶', '𝝏', '𝝰', '𝞉', '𝞪', '𝟃', 'ล'], 'b': ['Ƅ', 'ɮ', 'β', 'в', '๒', 'ᗷ', 'ᵇ', 'ᵦ', 'ḃ', 'ḅ', 'ḇ', '⒝', 'ⓑ', '♭', 'ⲃ', 'ｂ', '𝐛', '𝑏', '𝒃', '𝒷', '𝓫', '𝔟', '𝕓', '𝖇', '𝖻', '𝗯', '𝘣', '𝙗', '𝚋'], 'c': ['¢', 'ç', 'ć', 'ĉ', 'ċ', 'č', 'ƈ', 'ɔ', 'ς', 'Ͼ', 'ᑕ', 'ᒼ', 'ᴄ', 'ᶜ', '℃', 'ⅽ', '⒞', 'ⓒ', 'ⲥ', 'ｃ', '𝐜', '𝑐', '𝒄', '𝒸', '𝓬', '𝔠', '𝕔', '𝖈', '𝖼', '𝗰', '𝘤', '𝙘', '𝚌'], 'd': ['ð', 'ď', 'đ', 'ɖ', 'ɗ', 'ժ', '๔', '໓', 'ᗪ', 'ᵈ', 'ᵭ', 'ḋ', 'ḍ', 'ḏ', 'ḑ', 'ḓ', '₫', 'ⅆ', 'ⅾ', '∂', '⒟', 'ⓓ', 'ⲇ', 'ｄ', '𝐝', '𝑑', '𝒅', '𝒹', '𝓭', '𝔡', '𝕕', '𝖉', '𝖽', '𝗱', '𝘥', '𝙙', '𝚍', '𝛛'], 'e': ['è', 'é', 'ê', 'ë', 'ē', 'ĕ', 'ė', 'ę', 'ě', 'Ɛ', 'ǝ', 'ȅ', 'ȇ', 'ȩ', 'ɘ', 'ə', 'ɛ', 'ɜ', 'ɞ', 'ʚ', 'έ', 'ε', '϶', 'є', 'ҽ', 'ᗴ', 'ᥱ', 'ᵉ', 'ᵋ', 'ḙ', 'ḛ', 'ẹ', 'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'ệ', 'ₑ', 'ℇ', '℮', 'ℯ', 'ⅇ', '∉', '∌', '⒠', 'ⓔ', 'ⲉ', 'ｅ', '𝐞', '𝑒', '𝒆', '𝒺', '𝓮', '𝔢', '𝕖', '𝖊', '𝖾', '𝗲', '𝘦', '𝙚', '𝚎', '𝟈'], 'f': ['ƒ', 'ɟ', 'ʃ', 'ʄ', 'ϝ', 'ᖴ', 'ᶂ', 'ᶠ', 'ᶡ', 'ᶴ', 'ḟ', 'ẜ', 'ẝ', '⒡', 'ⓕ', 'ｆ', '𝐟', '𝑓', '𝒇', '𝒻', '𝓯', '𝔣', '𝕗', '𝖋', '𝖿', '𝗳', '𝘧', '𝙛', '𝚏', '🝡'], 'g': ['ĝ', 'ğ', 'ġ', 'ģ', 'ƃ', 'Ǥ', 'ǥ', 'ǧ', 'ǵ', 'ɓ', 'ɠ', 'ɡ', 'Ց', 'ق', 'გ', 'Ꮆ', 'ᵍ', 'ᶢ', 'ḡ', 'ℊ', '⒢', 'ⓖ', 'ﻮ', 'ｇ', '𝐠', '𝑔', '𝒈', '𝒼', '𝓰', '𝔤', '𝕘', '𝖌', '𝗀', '𝗴', '𝘨', '𝙜', '𝚐'], 'h': ['ĥ', 'ħ', 'ȟ', 'ɥ', 'ɦ', 'ɧ', 'ʰ', 'ʱ', 'н', 'ђ', 'ᕼ', 'ḣ', 'ḥ', 'ḧ', 'ḩ', 'ḫ', 'ẖ', 'ₕ', 'ℎ', 'ℏ', '⒣', 'ⓗ', 'ⲏ', 'ꜧ', 'ｈ', '𝐡', '𝑕', '𝒉', '𝒽', '𝓱', '𝔥', '𝕙', '𝖍', '𝗁', '𝗵', '𝘩', '𝙝', '𝚑'], 'i': ['ì', 'í', 'î', 'ï', 'ĩ', 'ī', 'ĭ', 'į', 'ı', 'Ɨ', 'ǐ', 'ȉ', 'ȋ', 'ɨ', 'ΐ', 'ί', 'ι', 'і', 'เ', 'Ꭵ', 'ᴉ', 'ᵎ', 'ᵢ', 'ᶤ', 'ḭ', 'ḯ', 'ỉ', 'ị', 'ὶ', 'ⁱ', 'ℹ', 'ⅈ', 'ⅰ', '⒤', 'ⓘ', 'ⲓ', '丨', 'ｉ', '𝐢', '𝑖', '𝒊', '𝒾', '𝓲', '𝔦', '𝕚', '𝖎', '𝗂', '𝗶', '𝘪', '𝙞', '𝚒'], 'j': ['ĵ', 'ǰ', 'ʲ', 'ј', 'ן', 'נ', 'ڶ', 'ᒎ', 'ⅉ', '⒥', 'ⓙ', 'ⱼ', 'ｊ', '𝐣', '𝑗', '𝒋', '𝒿', '𝓳', '𝔧', '𝕛', '𝖏', '𝗃', '𝗷', '𝘫', '𝙟', '𝚓'], 'k': ['ķ', 'ĸ', 'ƙ', 'ǩ', 'ʞ', 'κ', 'Ϗ', 'Ќ', 'к', 'қ', 'Ҝ', 'ᛕ', 'ᵏ', 'ḱ', 'ḳ', 'ḵ', 'ₖ', '⒦', 'ⓚ', 'ｋ', '𝐤', '𝑘', '𝒌', '𝓀', '𝓴', '𝔨', '𝕜', '𝖐', '𝗄', '𝗸', '𝘬', '𝙠', '𝚔', '𝞳'], 'l': ['ĺ', 'ļ', 'ľ', 'ŀ', 'Ł', 'ł', 'Ɩ', 'ɩ', 'ɭ', 'ʅ', 'ˡ', 'ᒪ', 'ᶅ', 'ᶥ', 'ᶩ', 'ḷ', 'ḻ', 'ḽ', 'ₗ', 'ℓ', 'ⅼ', '⒧', 'ⓛ', 'ㄥ', 'ｌ', '𝐥', '𝑙', '𝒍', '𝓁', '𝓵', '𝔩', '𝕝', '𝖑', '𝗅', '𝗹', '𝘭', '𝙡', '𝚕', '𝝞'], 'm': ['ɯ', 'ɱ', 'Μ', 'ϻ', 'м', 'ෆ', '๓', 'ო', 'ᗰ', 'ᵐ', 'ᵯ', 'ᶬ', 'ḿ', 'ṁ', 'ṃ', 'ₘ', 'ⅿ', '⒨', 'ⓜ', 'ⲙ', '㎥', 'ｍ', '𝐦', '𝑚', '𝒎', '𝓂', '𝓶', '𝔪', '𝕞', '𝖒', '𝗆', '𝗺', '𝘮', '𝙢', '𝚖'], 'n': ['ñ', 'ń', 'ņ', 'ň', 'ŉ', 'ŋ', 'ƞ', 'ǹ', 'Ƞ', 'ɲ', 'ɳ', 'ή', 'η', 'ռ', 'ח', 'ภ', 'ი', 'ᑎ', 'ᵑ', 'ᵰ', 'ᶮ', 'ᶯ', 'ṅ', 'ṇ', 'ṉ', 'ṋ', 'ὴ', 'ⁿ', 'ₙ', '⒩', 'ⓝ', 'ⲛ', '', 'ｎ', '𝐧', '𝑛', '𝒏', '𝓃', '𝓷', '𝔫', '𝕟', '𝖓', '𝗇', '𝗻', '𝘯', '𝙣', '𝚗', '𝜼', '𝝶', '𝞰', '𝟆'], 'o': ['º', 'ò', 'ó', 'ô', 'õ', 'ö', 'ø', 'ō', 'ŏ', 'ő', 'ơ', 'ǒ', 'ǫ', 'ȍ', 'ȏ', 'ȯ', 'ɵ', 'Θ', 'Ο', 'ο', 'σ', 'φ', 'ό', '௦', '๏', '໐', 'ᗝ', 'ᵒ', 'ọ', 'ỏ', 'ố', 'ồ', 'Ỗ', 'ộ', 'ớ', 'ờ', 'ở', 'ₒ', 'ℴ', '∅', '⒪', 'ⓞ', '☼', 'ⲟ', 'ㄖ', 'ｏ', '𝐨', '𝑜', '𝒐', '𝓄', '𝓸', '𝔬', '𝕠', '𝖔', '𝗈', '𝗼', '𝘰', '𝙤', '𝚘', '𝛉', '𝛐', '𝛔', '𝛰', '𝜊', '𝜎', '𝜭', '𝜽', '𝝄', '𝝾', '𝞂', '𝞸'], 'p': ['Þ', 'þ', 'Ƥ', 'ρ', 'ק', 'ᑭ', 'ᵖ', 'ṕ', 'ṗ', 'ₚ', '⒫', 'ⓟ', 'ⲣ', 'ꝑ', 'ｐ', '𝐩', '𝑝', '𝒑', '𝓅', '𝓹', '𝔭', '𝕡', '𝖕', '𝗉', '𝗽', '𝘱', '𝙥', '𝚙', '𝞺'], 'q': ['Ǫ', 'Ɋ', 'Ω', 'ϙ', 'ᵠ', 'ợ', '⒬', 'ⓠ', 'ｑ', '𝐪', '𝑞', '𝒒', '𝓆', '𝓺', '𝔮', '𝕢', '𝖖', '𝗊', '𝗾', '𝘲', '𝙦', '𝚚'], 'r': ['ŕ', 'ŗ', 'ř', 'ȑ', 'ȓ', 'ɍ', 'ɹ', 'ɾ', 'ʳ', 'Γ', 'г', 'ᖇ', 'ᵣ', 'ṙ', 'ṛ', 'ṟ', 'ℽ', '⒭', 'ⓡ', 'ⲅ', 'Ꞅ', 'ꞅ', 'ｒ', '𝐫', '𝑟', '𝒓', '𝓇', '𝓻', '𝔯', '𝕣', '𝖗', '𝗋', '𝗿', '𝘳', '𝙧', '𝚛', '𝚪'], 's': ['ś', 'ŝ', 'ş', 'š', 'ſ', 'ș', 'ʂ', 'ˢ', 'ѕ', 'ร', 'ᔆ', 'ᔕ', 'ᶳ', 'ṡ', 'ṣ', 'ṧ', 'ₛ', '⒮', 'ⓢ', 'ｓ', '𝐬', '𝑠', '𝒔', '𝓈', '𝓼', '𝔰', '𝕤', '𝖘', '𝗌', '𝘀', '𝘴', '𝙨', '𝚜'], 't': ['ţ', 'ť', 'ƚ', 'ƫ', 'ț', 'ȶ', 'ɬ', 'ʇ', 'τ', 'Շ', 'է', 'ᵗ', 'ᵵ', 'ṫ', 'ṭ', 'ṯ', 'ṱ', 'ẗ', 'ₜ', '⒯', 'ⓣ', 'ⱦ', 'ⲧ', 'ｔ', '𝐭', '𝑡', '𝒕', '𝓉', '𝓽', '𝔱', '𝕥', '𝖙', '𝗍', '𝘁', '𝘵', '𝙩', '𝚝'], 'u': ['µ', 'ù', 'ú', 'û', 'ü', 'ũ', 'ū', 'ŭ', 'ů', 'ű', 'ų', 'ư', 'ǔ', 'ȕ', 'ȗ', 'ʊ', 'ʯ', 'υ', 'ย', 'ᑌ', 'ᵘ', 'ᵤ', 'ᵾ', 'ṳ', 'ṵ', 'ṷ', 'ụ', 'ủ', 'Ữ', '⒰', 'ⓤ', 'ꭟ', 'ｕ', '𝐮', '𝑢', '𝒖', '𝓊', '𝓾', '𝔲', '𝕦', '𝖚', '𝗎', '𝘂', '𝘶', '𝙪', '𝚞', '𝝁', '𝝒', '𝞄', '𝞾'], 'v': ['ʋ', 'ʌ', 'ν', 'ύ', 'ѵ', 'Ѷ', 'ש', 'ᐯ', 'ᵛ', 'ᵥ', 'ṽ', 'ṿ', 'ⅴ', '⒱', 'ⓥ', 'ｖ', '𝐯', '𝑣', '𝒗', '𝓋', '𝓿', '𝔳', '𝕧', '𝖛', '𝗏', '𝘃', '𝘷', '𝙫', '𝚟', '𝝊', '𝝼', '𝞶'], 'w': ['ŵ', 'ʍ', 'ʷ', 'Ψ', 'ω', 'ώ', 'ധ', 'ฬ', 'ᗯ', 'ᵚ', 'ᶭ', 'ẁ', 'ẃ', 'ẅ', 'ẇ', 'ẉ', 'ẘ', '⒲', 'ⓦ', 'ⱳ', '꒳', 'ｗ', '𝐰', '𝑤', '𝒘', '𝓌', '𝔀', '𝔴', '𝕨', '𝖜', '𝗐', '𝘄', '𝘸', '𝙬', '𝚠', '𝛚', '𝜔', '𝝎'], 'x': ['ˣ', 'χ', 'Ж', 'א', 'ẋ', 'ẍ', 'ₓ', 'ⅹ', '⒳', 'ⓧ', 'ｘ', '𝐱', '𝑥', '𝒙', '𝓍', '𝔁', '𝔵', '𝕩', '𝖝', '𝗑', '𝘅', '𝘹', '𝙭', '𝚡'], 'y': ['¥', 'ý', 'ÿ', 'ŷ', 'ƴ', 'ȳ', 'ɏ', 'ʎ', 'ʸ', 'γ', 'λ', 'Ў', 'у', 'ч', 'ү', 'ץ', 'ყ', 'Ꮍ', 'ᵞ', 'ᵧ', 'ẏ', 'ẙ', 'ỳ', 'ỵ', 'ỷ', 'ỹ', 'Ỿ', 'ỿ', '⒴', 'ⓨ', 'ⲩ', 'ｙ', '𝐲', '𝑦', '𝒚', '𝓎', '𝔂', '𝔶', '𝕪', '𝖞', '𝗒', '𝘆', '𝘺', '𝙮', '𝚢', '𝛄', '𝞬'], 'z': ['ź', 'ż', 'ž', 'Ƶ', 'ᶻ', 'ẑ', 'ẓ', 'ẕ', '⒵', 'ⓩ', 'ｚ', '𝐳', '𝑧', '𝒛', '𝓏', '𝔃', '𝔷', '𝕫', '𝖟', '𝗓', '𝘇', '𝘻', '𝙯', '𝚣'], 'A': ['À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ā', 'Ă', 'Ą', 'ƛ', 'Ǎ', 'Ȁ', 'Ȃ', 'Ȧ', 'Ⱥ', 'Ʌ', 'Α', 'Λ', 'А', 'Ꭺ', 'Ꭿ', 'Ꮧ', 'ᴀ', 'ᴁ', 'ᴬ', 'Ḁ', 'Ạ', 'Ả', 'Ấ', 'Ẫ', '₳', '∀', '∆', 'Ⓐ', 'Ɐ', 'Ⲁ', 'Ａ', '𝐀', '𝐴', '𝑨', '𝒜', '𝓐', '𝔄', '𝔸', '𝕬', '𝖠', '𝗔', '𝘈', '𝘼', '𝙰', '𝚨', '𝚲', '𝛢', '𝜜', '𝝖', '𝞐', '𝞓', '🄐', '🄰', '🅐', '🅰', '🇦'], 'B': ['ß', 'ʙ', 'Β', '฿', 'ᴮ', 'Ḃ', 'Ḅ', 'Ḇ', 'ℬ', 'Ⓑ', 'Ⲃ', 'Ｂ', '𝐁', '𝐵', '𝑩', '𝒝', '𝓑', '𝔅', '𝔹', '𝕭', '𝖡', '𝗕', '𝘉', '𝘽', '𝙱', '𝚩', '𝜝', '𝝗', '𝞑', '🄑', '🄱', '🅑', '🅱', '🇧'], 'C': ['Ç', 'Ć', 'Ĉ', 'Ċ', 'Č', 'Ꮯ', '₵', 'ℂ', 'ℭ', 'Ⅽ', 'Ⓒ', 'Ｃ', '𝐂', '𝐶', '𝑪', '𝒞', '𝓒', '𝕮', '𝖢', '𝗖', '𝘊', '𝘾', '𝙲', '🄒', '🄫', '🄲', '🅒', '🅲', '🇨'], 'D': ['Ð', 'Ď', 'Đ', 'Ɗ', 'ᴅ', 'ᴰ', 'Ḋ', 'Ḍ', 'Ḏ', 'Ḑ', 'Ḓ', 'ⅅ', 'Ⅾ', 'Ⓓ', 'Ⲇ', 'Ｄ', '𝐃', '𝐷', '𝑫', '𝒟', '𝓓', '𝔇', '𝔻', '𝕯', '𝖣', '𝗗', '𝘋', '𝘿', '𝙳', '🄓', '🄭', '🄳', '🅓', '🅳', '🇩'], 'E': ['È', 'É', 'Ê', 'Ë', 'Ē', 'Ĕ', 'Ė', 'Ę', 'Ě', 'Ǝ', 'Ȅ', 'Ȇ', 'Ȩ', 'Ɇ', 'ɇ', 'Ε', 'Ξ', 'Σ', 'ϵ', 'Ё', 'Ꮛ', 'ᴇ', 'ᴱ', 'ᴲ', 'Ḙ', 'Ḛ', 'Ẹ', 'Ẻ', 'Ẽ', 'Ễ', '€', 'ℰ', '∃', '∈', 'Ⓔ', 'Ⲉ', 'Ｅ', '𝐄', '𝐸', '𝑬', '𝒠', '𝓔', '𝔈', '𝔼', '𝕰', '𝖤', '𝗘', '𝘌', '𝙀', '𝙴', '𝚬', '𝚵', '𝛦', '𝜠', '𝜩', '𝝐', '𝞔', '𝞝', '🄔', '🄴', '🅔', '🅴', '🇪'], 'F': ['Ƒ', 'ғ', 'Ḟ', '℉', 'ℱ', 'Ⅎ', 'ⅎ', 'Ⓕ', 'ꜰ', 'Ｆ', '𝐅', '𝐹', '𝑭', '𝒡', '𝓕', '𝔉', '𝔽', '𝕱', '𝖥', '𝗙', '𝘍', '𝙁', '𝙵', '𝟊', '🄕', '🄵', '🅕', '🅵', '🇫'], 'G': ['Ĝ', 'Ğ', 'Ġ', 'Ģ', 'Ɠ', 'Ǧ', 'Ǵ', 'ɢ', 'ᴳ', 'Ḡ', '₲', '⅁', 'Ⓖ', 'Ｇ', '𝐆', '𝐺', '𝑮', '𝒢', '𝓖', '𝔊', '𝔾', '𝕲', '𝖦', '𝗚', '𝘎', '𝙂', '𝙶', '🄖', '🄶', '🅖', '🅶', '🇬'], 'H': ['Ĥ', 'Ħ', 'Ȟ', 'ʜ', 'Η', 'ᴴ', 'Ḣ', 'Ḥ', 'Ḧ', 'Ḩ', 'Ḫ', 'Ἠ', 'ℋ', 'ℌ', 'ℍ', 'Ⓗ', 'Ⱨ', '㏋', 'Ｈ', '𝐇', '𝐻', '𝑯', '𝒣', '𝓗', '𝕳', '𝖧', '𝗛', '𝘏', '𝙃', '𝙷', '𝚮', '𝛨', '𝞖', '𝞗', '🄗', '🄷', '🅗', '🅷', '🇭'], 'I': ['Ì', 'Í', 'Î', 'Ï', 'Ĩ', 'Ī', 'Ĭ', 'Į', 'İ', 'Ĳ', 'Ǐ', 'Ȉ', 'Ȋ', 'ɪ', 'Ί', 'Ι', 'ᴵ', 'ᶦ', 'Ḭ', 'Ỉ', 'Ị', 'ℐ', 'ℑ', 'Ⅰ', 'Ⓘ', 'Ⲓ', 'ꞁ', 'ꟾ', 'Ｉ', '𝐈', '𝐼', '𝑰', '𝒤', '𝓘', '𝕀', '𝕴', '𝖨', '𝗜', '𝘐', '𝙄', '𝙸', '𝚰', '𝜤', '𝞘', '🄘', '🄸', '🅘', '🅸', '🇮'], 'J': ['Ĵ', 'ʆ', 'ᴊ', 'ᴶ', 'Ⓙ', 'Ｊ', '𝐉', '𝐽', '𝑱', '𝒥', '𝓙', '𝔍', '𝕁', '𝕵', '𝖩', '𝗝', '𝘑', '𝙅', '𝙹', '🄙', '🄹', '🅙', '🅹', '🇯'], 'K': ['Ķ', 'Ƙ', 'Ǩ', 'Κ', 'Ꮶ', 'ᴋ', 'ᴷ', 'Ḱ', 'Ḳ', 'Ḵ', '₭', 'K', 'Ⓚ', 'Ⲕ', 'Ꝅ', 'Ｋ', '𝐊', '𝐾', '𝑲', '𝒦', '𝓚', '𝔎', '𝕂', '𝕶', '𝖪', '𝗞', '𝘒', '𝙆', '𝙺', '𝚱', '𝛫', '𝜥', '𝞙', '🄚', '🄺', '🅚', '🅺', '🇰'], 'L': ['Ĺ', 'Ļ', 'Ľ', 'Ŀ', 'ʟ', 'Ꮦ', 'Ꮮ', 'ᴸ', 'ᶫ', 'Ḷ', 'Ḻ', 'Ḽ', 'ℒ', '⅃', 'Ⅼ', 'Ⓛ', 'Ⱡ', 'Ｌ', '𝐋', '𝐿', '𝑳', '𝒧', '𝓛', '𝔏', '𝕃', '𝕷', '𝖫', '𝗟', '𝘓', '𝙇', '𝙻', '🄛', '🄻', '🅛', '🅻', '🇱'], 'M': ['ന', 'ጢ', 'Ꮇ', 'ᴍ', 'ᴹ', 'Ḿ', 'Ṁ', 'Ṃ', '₥', 'ℳ', 'Ⅿ', 'Ⓜ', 'Ɱ', 'Ｍ', '𝐌', '𝑀', '𝑴', '𝒨', '𝓜', '𝔐', '𝕄', '𝕸', '𝖬', '𝗠', '𝘔', '𝙈', '𝙼', '𝚳', '𝛭', '𝜧', '𝝡', '𝞛', '🄜', '🄼', '🅜', '🅼', '🇲'], 'N': ['Ñ', 'Ń', 'Ņ', 'Ň', 'Ɲ', 'Ǹ', 'ɴ', 'Ν', 'Π', 'п', 'ᴺ', 'ᶰ', 'Ṅ', 'Ṇ', 'Ṉ', 'Ṋ', '₦', 'ℕ', 'Ⓝ', 'Ⲛ', 'Ｎ', '𝐍', '𝑁', '𝑵', '𝒩', '𝓝', '𝔑', '𝕹', '𝖭', '𝗡', '𝘕', '𝙉', '𝙽', '𝚴', '𝜨', '𝝢', '𝝥', '𝞜', '🄝', '🄽', '🅝', '🅽', '🇳'], 'O': ['Ò', 'Ó', 'Ô', 'Õ', 'Ö', 'Ø', 'Ō', 'Ŏ', 'Ő', 'Ơ', 'Ǒ', 'Ȍ', 'Ȏ', 'Ȯ', 'ට', 'Ꮎ', 'ᴏ', 'ᴑ', 'ᴼ', 'Ọ', 'Ỏ', 'Ồ', 'Ỡ', 'Ⓞ', 'Ⲟ', 'Ｏ', '𝐎', '𝑂', '𝑶', '𝒪', '𝓞', '𝔒', '𝕆', '𝕺', '𝖮', '𝗢', '𝘖', '𝙊', '𝙾', '𝜪', '𝝤', '𝞞', '𝞡', '🄞', '🄾', '🅞', '🅾', '🇴'], 'P': ['Ρ', 'ᴘ', 'ᴩ', 'ᴾ', 'Ṕ', 'Ṗ', '₱', 'ℙ', 'Ⓟ', 'Ｐ', '𝐏', '𝑃', '𝑷', '𝒫', '𝓟', '𝔓', '𝕻', '𝖯', '𝗣', '𝘗', '𝙋', '𝙿', '🄟', '🄿', '🅟', '🅿', '🆊', '🇵'], 'Q': ['ℚ', 'Ⓠ', 'Ｑ', '𝐐', '𝑄', '𝑸', '𝒬', '𝓠', '𝔔', '𝕼', '𝖰', '𝗤', '𝘘', '𝙌', '𝚀', '🄠', '🅀', '🅠', '🆀', '🇶'], 'R': ['Ŕ', 'Ŗ', 'Ř', 'Ȑ', 'Ȓ', 'Ɍ', 'ʀ', 'ʶ', 'я', 'Ꮢ', 'ᴚ', 'ᴿ', 'Ṙ', 'Ṛ', 'Ṟ', 'ℛ', 'ℜ', 'ℝ', '℞', '℟', 'Ⓡ', 'Ɽ', 'ꓤ', 'Ｒ', '𝐑', '𝑅', '𝑹', '𝒭', '𝓡', '𝕽', '𝖱', '𝗥', '𝘙', '𝙍', '𝚁', '𝜞', '🄡', '🄬', '🅁', '🅡', '🆁', '🇷'], 'S': ['$', 'Ś', 'Ŝ', 'Ş', 'Š', 'Ƨ', 'Ș', 'Ϛ', 'Ꮥ', 'Ṡ', 'Ṣ', 'Ⓢ', 'ꗟ', 'ꜱ', '＄', 'Ｓ', '𝐒', '𝑆', '𝑺', '𝒮', '𝓢', '𝔖', '𝕊', '𝕾', '𝖲', '𝗦', '𝘚', '𝙎', '𝚂', '𝜮', '🄢', '🄪', '🅂', '🅢', '🆂', '🇸'], 'T': ['Ţ', 'Ť', 'Ŧ', 'Ƭ', 'Ʈ', 'Ț', 'Ͳ', 'Τ', 'т', 'ᴛ', 'ᵀ', 'Ṫ', 'Ṭ', 'Ṯ', 'Ṱ', '₮', 'Ⓣ', 'Ⲧ', 'Ｔ', '𝐓', '𝑇', '𝑻', '𝒯', '𝓣', '𝔗', '𝕋', '𝕿', '𝖳', '𝗧', '𝘛', '𝙏', '𝚃', '𝚻', '𝜯', '𝞣', '🄣', '🅃', '🅣', '🆃', '🇹'], 'U': ['Ù', 'Ú', 'Û', 'Ü', 'Ũ', 'Ū', 'Ŭ', 'Ů', 'Ű', 'Ų', 'Ư', 'Ǔ', 'Ǘ', 'Ȕ', 'Ȗ', 'Ʉ', 'Ꮼ', 'ᴜ', 'ᵁ', 'ᶸ', 'Ṳ', 'Ṵ', 'Ṷ', 'Ụ', 'Ủ', '∪', 'Ⓤ', 'Ｕ', '𝐔', '𝑈', '𝑼', '𝒰', '𝓤', '𝔘', '𝕌', '𝖀', '𝖴', '𝗨', '𝘜', '𝙐', '𝚄', '𝞨', '🄤', '🅄', '🅤', '🆄', '🇺'], 'V': ['ᴠ', 'Ṽ', 'Ṿ', 'Ⅴ', '⋁', 'Ⓥ', 'ⱽ', 'Ｖ', '𝐕', '𝑉', '𝑽', '𝒱', '𝓥', '𝔙', '𝕍', '𝖁', '𝖵', '𝗩', '𝘝', '𝙑', '𝚅', '🄥', '🅅', '🅥', '🆅', '🇻', '🜄'], 'W': ['Ŵ', 'Ɯ', 'ш', 'Ꮃ', 'ᴡ', 'ᵂ', 'Ẁ', 'Ẃ', 'Ẅ', 'Ẇ', 'Ẉ', '₩', 'Ⓦ', 'Ⲱ', 'Ｗ', '𝐖', '𝑊', '𝑾', '𝒲', '𝓦', '𝔚', '𝕎', '𝖂', '𝖶', '𝗪', '𝘞', '𝙒', '𝚆', '𝜲', '𝞦', '🄦', '🅆', '🅦', '🆆', '🇼'], 'X': ['᙭', 'Ẋ', 'Ẍ', 'Ⅹ', 'Ⓧ', 'Ｘ', '𝐗', '𝑋', '𝑿', '𝒳', '𝓧', '𝔛', '𝕏', '𝖃', '𝖷', '𝗫', '𝘟', '𝙓', '𝚇', '🄧', '🅇', '🅧', '🆇', '🇽'], 'Y': ['Ý', 'Ŷ', 'Ÿ', 'Ƴ', 'Ȳ', 'Ɏ', 'ʏ', 'Υ', 'Ẏ', 'Ỳ', 'Ỵ', 'Ỷ', 'Ỹ', 'Ⓨ', 'Ⲩ', 'Ｙ', '𝐘', '𝑌', '𝒀', '𝒴', '𝓨', '𝔜', '𝕐', '𝖄', '𝖸', '𝗬', '𝘠', '𝙔', '𝚈', '𝚼', '𝝪', '𝞤', '🄨', '🅈', '🅨', '🆈', '🇾'], 'Z': ['Ź', 'Ż', 'Ž', 'ƶ', 'Ζ', 'ᙆ', 'ᴢ', 'Ẑ', 'Ẓ', 'Ẕ', '₴', 'ℤ', 'ℨ', 'Ⓩ', 'Ɀ', 'Ｚ', '𝐙', '𝑍', '𝒁', '𝒵', '𝓩', '𝖅', '𝖹', '𝗭', '𝘡', '𝙕', '𝚉', '𝞕', '🄩', '🅉', '🅩', '🆉', '🇿']};
    const classz = /[\u{1F000}-\u{1F02B}\u{1F030}-\u{1F093}\u{1F0A0}-\u{1F0F5}\u{1F300}-\u{1F5FF}\u{1F600}-\u{1F64F}\u{1F650}-\u{1F667}\u{1F680}-\u{1F6FC}\u{1F7E0}-\u{1F7EB}\u{1F900}-\u{1F9FF}\u{1FA70}-\u{1FAD6}\u{E0000}-\u{E007F}\u0000-\u001F\u007F-\u00A0\u00AD\u0300-\u036F\u0483-\u0489\u058D\u058E\u05BA\u05C1\u05C2\u0610-\u061A\u061C\u064B-\u065F\u0670\u06D6-\u06ED\u0711\u0730-\u074A\u07A6-\u07B0\u07EB-\u07F3\u07FD\u08D4-\u0903\u093A-\u094F\u0955-\u0957\u0981-\u0983\u09BC\u09BE-\u09CD\u09D7\u09E2\u09E3\u09FE\u0A01-\u0A03\u0A3C-\u0A51\u0A70\u0A71\u0A75\u0A81-\u0A83\u0ABC\u0ABE-\u0ACD\u0AE2\u0AE3\u0AFA-\u0B03\u0B3C\u0B3E-\u0B57\u0B62\u0B63\u0B82\u0BBE-\u0BCD\u0BD7\u0C00-\u0C04\u0C3E-\u0C56\u0C62\u0C63\u0C80-\u0C83\u0CBC\u0CBE-\u0CD6\u0CE2\u0CE3\u0D00-\u0D03\u0D3B\u0D3C\u0D3E-\u0D4E\u0D57\u0D81-\u0D83\u0DCA-\u0DDF\u0DF2\u0DF3\u0D31\u0D34-\u0E3A\u0E47-\u0E4E\u0EB1\u0EB4-\u0EBC\u0EC8-\u0ECD\u0F18\u0F19\u0F35\u0F37\u0F39\u0F3E\u0F3F\u0F71-\u0F84\u0F86\u0F87\u0F8D-\u0FBC\u102B-\u103E\u1056-\u1059\u105E-\u1060\u1062-\u1064\u1067-\u106D\u1071-\u1074\u1082-\u108D\u108F\u109A-\u109D\u135D-\u135F\u1780-\u17FF\u180B-\u180F\u200B-\u200F\u202A-\u202F\u2066-\u2069\u20D0-\u20F0\u231A\u231B\u2320\u2321\u239B-\u23AE\u23B2\u23B3\u23B7\u23E9-\u23EC\u23F0\u23F3\u25FB-\u25FE\u2600-\u2767\u2794-\u27BF\u2934\u2935\u2B00-\u2B2F\u2B50\u2B55\u2CEF-\u2CF1\u2D7F\u2D80-\u2DFF\u302A-\u302F\u4DC0-\u4DFF\uA674-\uA67D\uA6F0-\uA6F1\uA8E0-\uA8F1\uA8FF\uA926-\uA92D\uA980-\uA9DF\uAA29-\uAA36\uAA43\uAA4C\uAA4D\uAA7B-\uAA7D\uABE3-\uABEA\uABEC\uABED\uFE00-\uFE0F\uFE20-\uFE2F]+/gu
    /* eslint-enable */
    const title = document.getElementsByClassName('video-title')[0];
    const entity = title.textContent.normalize('NFC').replace(/\uFE0F/g, '');
    console.log(entity);
    let nentity = entity;
    // const rentity = entity.split('');
    const m = new Map();
    for (const k in fiftyfive) {
        for (const c of fiftyfive[k]) {
            m.set(c, k);
        }
    }
    Array.from(m).forEach(([k, v]) => {
        nentity = nentity.replaceAll(k, v);
    });
    const group = [];
    const match = [...nentity.matchAll(/[a-zA-Z]+/g)];
    for (let i = 0; i < match.length; i++) {
        const text = match[i][0];
        if (entity.indexOf(text) != -1) {
            continue;
        } else {
            group.push(text);
        }
    }
    const reg = r(group);
    for (let i = 0; i < group.length; i++) {
        console.log(group[i], reg[i]);
        nentity = nentity.replace(group[i], reg[i]);
    }
    const force = true; // 如需保留emoji，请改成false
    if (force) {
        nentity = nentity.replace(classz, ' ');
        nentity = nentity.replace(/ +/g, ' ');
        nentity = nentity.trim();
    }
    console.log(nentity);
    title.textContent = nentity;
}

const debounce = (callback) => {
    let timer = null;
    return () => {
        if (timer) {
            window.clearTimeout(timer);
        }
        timer = window.setTimeout(() => {
            callback();
        }, 100);
    };
};

const observer = new MutationObserver(debounce(n));

const target = document.getElementById('viewbox_report');
target &&
  observer.observe(target, {attributes: true, childList: true, subtree: true});
